//Напишите программу, которая 
//принимает на вход число N и выдаёт 
//произведение чисел от 1 до N.

void Lenght(int a)
{
    string num = a.ToString();
    Console.WriteLine(num.Length);
}

Lenght(167);