// 0. Напишите программу, которая на вход принимает число и
//    Выдаёт его квадрат (число умноженное на само себя).

Console.WriteLine("Write a number: ");
string s_a = Console.ReadLine();

int a = int.Parse(s_a);
Console.WriteLine(a * a);
