// 0. Напишите программу, которая на вход принимает число и
//    Выдаёт его квадрат (число умноженное на само себя).

Console.WriteLine("Write a number: ");

int a = int.Parse(Console.ReadLine());
Console.WriteLine(a * a);
